In [19]:
!pip install db-sqlite3
import sqlite3

Requirement already satisfied: db-sqlite3 in c:\users\pranathi\anaconda3\lib\site-packages (0.0.1)
Requirement already satisfied: db in c:\users\pranathi\anaconda3\lib\site-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in c:\users\pranathi\anaconda3\lib\site-packages (from db->db-sqlite3) (1.2.1)

In [30]:
conn=sqlite3.connect('sample1.db')
cur=conn.cursor()
print ("Opened database successfully");

Opened database successfully

In [31]:
conn.execute('''CREATE TABLE EMPLOYEE2
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(30),
         SALARY         REAL);''')
print ("Table created successfully");

Table created successfully

In [32]:
conn.execute("INSERT INTO EMPLOYEE2 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Pranathi', 19, 'Goa', 2000000.00 )");

conn.execute("INSERT INTO EMPLOYEE2 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Anisha', 25, 'Kochi', 15000.00 )");

conn.execute("INSERT INTO EMPLOYEE2 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teju', 13, 'Hyderabad', 20000.00 )");

conn.execute("INSERT INTO EMPLOYEE2 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Manisha', 22, 'Ranchi ', 65000.00 )");

conn.commit()
print ("Records created successfully");

Records created successfully

In [33]:
for row in conn.execute('select * from EMPLOYEE2'):
        print(row)

(1, 'Pranathi', 19, 'Goa', 2000000.0)
(2, 'Anisha', 25, 'Kochi', 15000.0)
(3, 'Teju', 13, 'Hyderabad', 20000.0)
(4, 'Manisha', 22, 'Ranchi ', 65000.0)

In [34]:
records = [(5, 'Josh', 18, 'Chennai', 100000.00),
        (6, 'Deepthi', 19, 'Mumbai', 250000),
        (7, 'Aira', 27, 'Delhi', 500000)]

In [35]:
cur.executemany('INSERT INTO EMPLOYEE2 VALUES(?,?,?,?,?);',records);

In [36]:
print('We have inserted', cur.rowcount, 'records to the table.')

We have inserted 3 records to the table.

In [37]:
for row in conn.execute('select * from EMPLOYEE2'):
        print(row)

(1, 'Pranathi', 19, 'Goa', 2000000.0)
(2, 'Anisha', 25, 'Kochi', 15000.0)
(3, 'Teju', 13, 'Hyderabad', 20000.0)
(4, 'Manisha', 22, 'Ranchi ', 65000.0)
(5, 'Josh', 18, 'Chennai', 100000.0)
(6, 'Deepthi', 19, 'Mumbai', 250000.0)
(7, 'Aira', 27, 'Delhi', 500000.0)

In [38]:
conn.commit()

In [39]:
conn.close()